export const dataList = [
  {
    title: 'Про нас',
    list: [
      { text: 'Доставка', link: '/' },
      { text: 'Умови користування сайтом', link: '/' },
    ],
  },
  {
    title: 'Покупцям',
    list: [
      { text: 'Гарантія', link: '/' },
      { text: 'Політика конфіденціності', link: '/' },
    ],
  },
  {
    title: 'Продавцям',
    list: [
      { text: 'Платні послуги', link: '/' },
      { text: 'Карта сайту', link: '/' },
    ],
  },
  {
    title: 'Служба підтримки',
    list: [
      { text: 'Реклама на сайті', link: '/' },
      { text: 'Карта регіонів', link: '/' },
    ],
  },
];
